## 127893201980: Alarms
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 5 to add, 0 to change, 1 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_kms_key.sns_cloudwatch will be created
  + resource "aws_kms_key" "sns_cloudwatch" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "KMS key for CloudWatch SNS topic"
      + enable_key_rotation                = false
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::127893201980:root"
                        }
                      + Resource  = "*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "kms:GenerateDataKey*",
                          + "kms:Decrypt",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "cloudwatch.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + tags                               = {
          + "CostCentre" = "cbs-127893201980"
          + "Product"    = "cloud-based-sensor"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "cbs-127893201980"
          + "Product"    = "cloud-based-sensor"
          + "Terraform"  = "true"
        }
    }

  # aws_sns_topic.cloudwatch_alarm will be created
  + resource "aws_sns_topic" "cloudwatch_alarm" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + kms_master_key_id           = (known after apply)
      + name                        = "cbs-cloudwatch-alarm"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + tags                        = {
          + "CostCentre" = "cbs-127893201980"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCentre" = "cbs-127893201980"
          + "Terraform"  = "true"
        }
    }

  # aws_sns_topic_subscription.cloudwatch_alarm will be created
  + resource "aws_sns_topic_subscription" "cloudwatch_alarm" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "arn:aws:lambda:ca-central-1:127893201980:function:cbs-notify-slack"
      + endpoint_auto_confirms          = false
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:us-east-1:127893201980:cbs-cloudwatch-alarm"
    }

  # module.notify_slack.aws_lambda_permission.notify_slack[0] must be replaced
-/+ resource "aws_lambda_permission" "notify_slack" {
      ~ id            = "AllowExecutionFromSNS-cbs-notify-slack-0" -> (known after apply)
      ~ source_arn    = "arn:aws:sns:us-east-1:127893201980:cbs-cloudwatch-alarm" -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.notify_slack.aws_lambda_permission.notify_slack[1] will be created
  + resource "aws_lambda_permission" "notify_slack" {
      + action        = "lambda:InvokeFunction"
      + function_name = "cbs-notify-slack"
      + id            = (known after apply)
      + principal     = "sns.amazonaws.com"
      + source_arn    = "arn:aws:sns:us-east-1:127893201980:cbs-cloudwatch-alarm"
      + statement_id  = "AllowExecutionFromSNS-cbs-notify-slack-1"
    }

Plan: 5 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.billing_change_over_threshold"]
WARN - plan.json - main - Missing Common Tags: ["module.notify_slack.aws_cloudwatch_log_group.notify_slack_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.notify_slack.aws_iam_policy.notify_slack_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.notify_slack.aws_iam_role.notify_slack_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.notify_slack.aws_lambda_function.notify_slack"]

22 tests, 17 passed, 5 warnings, 0 failures, 0 exceptions

```

</details>
